package hnhnh.jk.util;

import com.hikvision.netsdk.HCNetSDK;
import com.hikvision.netsdk.NET_DVR_DEVICEINFO_V30;
import 间.工具.时间;

public class 监控 {

    public static final String 地址 = "$监控";

    public static 监控信息[] 所有() {
        /*
         集合<监控信息> $所有 = new 集合<>();
         File[] $文件 = 文件.取文件列表(地址);
         for (File $单个 : $文件) {
         监控信息 $信息 = (监控信息)JSON.读取($单个.getPath(), 监控信息.class);
         if ($信息 == null) continue;
         $所有.添加($信息);
         }
         return $所有.到数组(监控信息.class);
         */
        String $地址 = "117.40.170.196";
        String $用户 = "admin";
        String $密码 = "a1234567";
        监控信息 $1 = new 监控信息();
        $1.地址 = $地址;
        $1.用户 = $用户;
        $1.密码 = $密码;
        $1.端口 = 9000;
        $1.名称 = "90号录像机";
       
        $1.内容 = new String[][] {
            {"0","车库口"},
            {"1","高三文补一班"},
            {"2","高三理三班"},
            {"3","高三理四班"},
            {"4","高三理八班"},
            {"5","高三文补二班"},
            {"6","南大门"},
            {"7","实验楼北角"},
            {"8","删除"},
            {"9","笃行楼北"},
            {"10","致远楼南角"},
            {"11","实验楼北角"},
            {"12","笃行楼西角"},
            {"13","笃行楼与铭志楼斜角"},
            {"14","图书馆西角"},
            {"15","高三理六班"},
            {"16","致远楼与实验楼斜角"},
            {"17","科技楼东南角"},
            {"18","高三理七班"},
            {"19","东大门"},
            {"20","删除"},
            {"21","高三理二班"},
            {"22","高三理五班"},
        };
        监控信息 $2 = new 监控信息();
        $2.地址 = $地址;
        $2.用户 = $用户;
        $2.密码 = $密码;
        $2.端口 = 9001;
        $2.名称 = "91号录像机";
        $2.内容 = new String[][] {
            {"0","高二文二班"},
            {"1","高二八班"},
            {"2","高二一班"},
            {"3","高二文三班"},
            {"4","高二十二班"},
            {"5","高二四班"},
            {"6","高二十一班"},
            {"7","高二二班"},
            {"8","高二五班"},
            {"9","高二九班"},
            {"10","2105"},
            {"11","2106"},
            {"12","高二十四班"},
            {"13","高二文一班"},
            {"14","高二年级部"},
            {"15","高二六班"},
            {"16","2102"},
            {"17","高二三班"},
            {"18","高二十三班"},
            {"19","高二七班"},
            {"20","删除"},
            {"21","高三九班"},
            {"22","高二十六班"},
            {"23","3206"},
        };
        监控信息 $3 = new 监控信息();
        $3.地址 = $地址;
        $3.用户 = $用户;
        $3.密码 = $密码;
        $3.端口 = 9002;
        $3.名称 = "92号录像机";
        $3.内容 = new String[][] {
            {"0","高三八班"},
            {"1","3105"},
            {"2","高三一班"},
            {"3","高三三班"},
            {"4","3102"},
            {"5","高三六班"},
            {"6","3104"},
            {"7","高三十二班"},
            {"8","高三十七班"},
            {"9","高三十一班"},
            {"10","高三年级部"},
            {"11","高三十三班"},
            {"12","高三十五班"},
            {"13","高三十班"},
            {"14","高三文二班"},
            {"15","高三文一班"},
            {"16","高三文三班"},
            {"17","高三七班"},
            {"18","高三五班"},
            {"19","高三十四班"},
            {"20","高三二班"},
            {"21","高三四班"},
            {"22","高三九班"},
            {"23","高三十六班"},
        };
        监控信息 $4 = new 监控信息();
        $4.地址 = $地址;
        $4.用户 = $用户;
        $4.密码 = $密码;
        $4.端口 = 9003;
        $4.名称 = "93号录像机";
        $4.内容 = new String[][] {  
            {"0","致远楼西道"},
            {"1","科技楼东南角"},
            {"2","笃行楼与铭志楼斜角"},
            {"3","高三理一班"},
            {"4","高一六班"},
            {"5","高一十四班"},
            {"6","高一十二班"},
            {"7","高一七班"},
            {"9","高一十班"},
            {"10","高一十六班"},
            {"11","高一十一班"},
            {"12","高一八班"},
            {"13","高一二班"},
            {"14","高一九班"},
            {"15","高一三班"},
            {"16","1102"},
            {"17","高一五班"},
            {"18","高一年级部"},
            {"19","高一十七班"},
            {"20","高一一班"},
            {"21","1101"},
            {"22","高一十五班"},
            {"23","高一十三班"},
        };
        return new 监控信息[]{$1,$2,$3,$4};
    }

    public static void 新建(监控信息 $信息) {
        //JSON.保存(地址 + "/" + 时间.时间戳() + ".json", $信息);
    }

    public static boolean 初始化() {
        return HCNetSDK.getInstance().NET_DVR_Init();
    }

    public static boolean 释放() {
        return HCNetSDK.getInstance().NET_DVR_Cleanup();
    }

    public static boolean 置超时(int $超时) {
        return HCNetSDK.getInstance().NET_DVR_SetConnectTime($超时);
    }

    public static int 登录(监控信息 $信息) {
        NET_DVR_DEVICEINFO_V30 $设备 = new NET_DVR_DEVICEINFO_V30();
        $信息.登录码 = HCNetSDK.getInstance().NET_DVR_Login_V30($信息.地址, $信息.端口, $信息.用户, $信息.密码, $设备);
        if ($设备.byChanNum > 0) {
            $信息.起始 = $设备.byStartChan;
            $信息.通道 = $设备.byChanNum;
        } else if ($设备.byIPChanNum > 0) {
            $信息.起始 = $设备.byStartDChan;
            $信息.通道 = $设备.byIPChanNum
                + $设备.byHighDChanNum * 256;
        }
        return $信息.登录码;
    }

    public static boolean 登出(int $会话) {
        return HCNetSDK.getInstance().NET_DVR_Logout_V30($会话);
    }

}
